{
    "about": "About",
    "projects": "Projects",
    "contact": "Contact",
	"personal_project": "Personal project",
	"professional_projects": "Professional projects",
	"student_projects": "Student projects",
	"contact_me": "Contact me",
	
	"about_p0": "After obtaining a degree in Mobile Application Development, during which I was able to create games on Android and Windows Phone, I specialized by continuing an Innovative Project Management Master in video games.",
	"about_p1": "In this class, I acquired a solid knowledge of project management while improving my programming skills as a developer in each of the projects I have participated in.",
	"cv_label": "Check my CV",
	"cv_image_src": "assets/images/CV_en.png",
	"cv_href": "assets/documents/CV_Romuald_Rugoletto_en.pdf",
	
	"vuranib_p0": "Turn-based multiplayer tactical game developed with Unity 3D (C#) for smartphones",
	"vuranib_p1": "The player will evolve several teams of pirates by facing other teams of players online in tactical turn-based battles. During a battle, each player has 5 minutes to eliminate the opposing captain by using the powers and movements of his crew members.",
	"vuranib_st1": "<u>Developments done on the Unity 3D game (C#)</u>",
	"vuranib_p2": "<ul class='mb-3 text-left'><li>Implementation of a scalable architecture.</li><li>Development of the core gameplay with almost 10 different characters.</li><li>Secure and synchronized communication with the server. The real-time connection being necessary in battle since each player has 5mins to win.</li><li>Development of the team creation system.</li><li>Implementation of a ranking system.</li><li>Implementation of unit tests.</li><li>Development of several tools to simplify repetitive development tasks:<ul><li>DataUpdater: update the server database from Unity's Scriptables Objects (and vice versa).</li><li>PseudoFENGenerator: I based on the Forsyth-Edwards notation by adding the specificities of my game, which allows me to create terrains with particular situations to test the skills of some units in game, but also to write unit tests more quickly and efficiently.</li><li>Spritesheet importer: imports spritesheets into Unity by creating by default the folders, animations, etc. This system saves me a lot of time when creating a new character.</li></ul></li></ul>",
	"vuranib_st2":"<u>Developments achieved on NodeJS server (Typescript/Javascript)</u>",
	"vuranib_p3":"<ul class='mb-3 text-left'><li>Implementation of API</li><li>Combat instance management, players only display the game state they received from the server and communicate only with it (which should limit the possibilities of cheating).</li><li>Player profile management (personal information, ranking, teams, etc.).</li><li>Implementation of unit tests.</li><li>Development of a second server reserved for the AI. My game may not be known so to overcome the lack of opponents, players will face an AI if the time to find an opponent exceeds 30seconds. For the main server, a connection from this second server is considered a regular player connection. This architecture allows me to have a management of the fights without particular cases and a less big workload on the main server.</li></ul>",
	"vuranib_st3":"<u>Remaining goals for the alpha version</u>",
	"vuranib_p4":"<ul class='mb-3 text-left'><li>Design and integrate 10 characters with their own identity (graphics + movement + skills + lore).</li><li>Design and integrate a striking interface consistent with the game's universe. </li><li>Develop an in-game store.</li><li>Develop a daily/weekly/seasonal quest system.</li><li>Develop a battle pass system.<li>Host the servers (currently local) online.</li></ul>",
	
	"dofus_p0": "Turn-based tactical MMORPG released in 2004 (Java)",
	"dofus_p1": "As part of the server team, I participated in maintaining, developing, and integrating features of the <i>Dofus</i> game, while ensuring the stability of the servers to support the thousands of daily players that populate them.",
	"dofus_p2": "<li>Development and improvement of moderation tools</li><li>Implementation and refactoring of in-game features</li><li>Design and refactoring of the architecture of several modules of the project</li><li>Weekly maintenance of the servers</li><li>Continuous monitoring of the maintainability of the code and the stability of the servers in order to offer the best experience to the players</li><li>Elaboration and realization of functional tests</li><li>Writing of documentation and technical monitoring</li>",
	
	"darkness_p0": "Rail shooter on PSVR in virtual reality developed with Unity 3D (C#)",
	"darkness_p1": "I contributed to the development of <i>Darkness RollerCoaster: Ultimate Shooter Edition</i> from may 2018 to september 2019. First as part of a four-month internship leading to the validation of my first year of master's degree. Then by continuing the collaboration with the company after the internship as a freelancer. To finish with a new six-month internship thus validating my last year of study and allowed us to complete the game's development.",
	"darkness_p2": "<li>Unity 3D build on PSVR (Playstation 4)</li><li>Core gameplay development (shooting / protection / inventory / points /...)</li><li>Development of unity tools (camera filter manager / cross-platform input controller /...)</li><li>Procedural generation of levels</li>",
	
	"excessive_speed_p0": "Smartphone car game in augmented reality (ARKit / ARCore) with Unity 3D (C#)",
	"excessive_speed_p1": "I took part in the development of Excessive Speed at the end of its production over the period may-june 2018 during a four-month internship leading to the validation of my first year of master's degree.",
	"excessive_speed_p2": "<li>Development of a bonus / malus manager</li><li>Added a calibration function to correctly define the game area (size / distance / orientation)</li><li>Improvement of the 'Try again' function so that the ARKit and ARCore keep the anchor points between scenes</li>",
	
	"ram_p0": "Adventure game on smartphone with Unity 3D (C#)",
	"ram_p1": "Gameplay mixes various types of games (adventure, infiltration, running) and makes players evolve in a galaxy endangered by an occult group. This project was carried out as part of my second year of master's degree in collaboration with 6 other people, from october 2018 until our presentation at the International Festival of Games in Cannes in february 2019. Initially planned with more gameplay phases, we had to review the GDD and replace several phases with cinematics (2D ones) due to a lack of time and human resources.",
	"ram_p2": "<li>Development of all functionalities (only developer in the team)</li><li>Integration (sounds / level design / images / animations /...)</li><li>3D Help: the scope of the project required that the entire team produce graphical assets</li>",
	
	"perfect_match_p0": "Beat them all developed for Android with the Unity3d engine (C#)",
	"perfect_match_p1": "The player controls a couple of characters who will have to fight together against the henchmen of the Infernos' master, with a single objective: to protect each other. This project was carried out as part of my first year of master's degree in collaboration with 5 other people, from october 2017 until our presentation at the Cannes International Games Festival in february 2018.",
	"perfect_match_p2": "<li>Development of boss and enemy patterns (state machine)</li><li>Implementation of A* (pathfinding) based not on Unity's navmesh but on colliders</li><li>Integration of player, object and boss animations</li>",
	
	"g7_p0": "Car game on Windows Phone native (C# / XAML)",
	"g7_p1": "The player controls a vehicle that tries to escape the police by driving in the wrong direction. The goal is to make as many points as possible by going as far as possible by dodging vehicles that arrive in front. The game includes the ability to enter a nickname, choose your vehicle and a ranking to compare yourself to the other players. This project was done as part of my license in mobile application development and was my first Game jam (less than 24 hours of development), but without any theoretical knowledge in video game development. This is what gave me the desire to continue my studies with a master's degree in video games.",
	"g7_p2": "<li>Development of the engine part (physics / collision management / acceleration / instantiation according to the Object pool pattern / ...)</li><li>Implementation of the gameplay (displacements / balancing between acceleration and vehicle spawn /...)</li><li>Saving preferences (profiles / ranking)</li>",
	
	"rgame_p0": "Speed and visual acuity game developed for Android native (Java)",
	"rgame_p1": "RGame is a fan-game for Nintendo Mario and Pokemon games, in which the player will have to find the intruder symbol as quickly as possible among many moving targets. The game has 4 levels of difficulty, several game modes with customizable themes and a multiplayer ranking. RGame is the first game I developed, I made the whole game except for the graphics which are exclusively fan art nintendo sprites.",
	
	"form_label_name": "Name",
	"form_label_email": "Email adress",
	"form_label_message": "Message",
	"form_placeholder_name": "Name",
	"form_placeholder_email": "Email adress",
	"form_placeholder_message": "Message",
	"form_send": "Send",
	
	"return":"Return"
}
